d3vv3/open-motorcycle-intercom/sdkconfig.defaults
# OMI - ESP32-S3 SDK Configuration Defaults
# These settings are applied on first build or after `idf.py fullclean`

# Target
CONFIG_IDF_TARGET="esp32s3"

# Serial flasher
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FreeRTOS - optimize for low latency
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# CPU frequency - balance performance and power
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Logging - enable timestamps
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_TIMESTAMP_SOURCE_RTOS=y

# WiFi/ESP-NOW (required for mesh)
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n

# Bluetooth - disabled for now (will re-enable for HFP gateway later)
CONFIG_BT_ENABLED=n

# UART Bridge to nRF52840 (for future use)
CONFIG_UART_ISR_IN_IRAM=y

# Power management - enable for battery optimization
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y

# Timer - high resolution for TDMA timing
CONFIG_ESP_TIMER_TASK_STACK_SIZE=4096
CONFIG_ESP_TIMER_SUPPORTS_ISR_DISPATCH_METHOD=y

# Memory optimization
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=3072
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# Watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# Compiler optimization
CONFIG_COMPILER_OPTIMIZATION_PERF=y
